## 판다스 복습

In [1]:
import pandas as pd

* 데이터프레임 만들기

In [2]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[2,3,4]})
df1

   A  B
0  1  2
1  2  3
2  3  4

In [3]:
df2 = pd.DataFrame([[1,2], [2,3], [3,4]], columns=['A','B'])
df2

   A  B
0  1  2
1  2  3
2  3  4

* 컬럼명 바꾸기

In [5]:
df1.columns = ['Apple', 'Samsung']
df1

   Apple  Samsung
0      1        2
1      2        3
2      3        4

In [7]:
print(df1.index)

RangeIndex(start=0, stop=3, step=1)

* 인덱스 변경

In [8]:
df1.index = ['1분기','2분기','3분기']
df1

     Apple  Samsung
1분기      1        2
2분기      2        3
3분기      3        4

* " "안에 '

In [11]:
"job's iphone"

"job's iphone"

In [13]:
'job\'s iphone'

"job's iphone"

* 반복문

In [14]:
[str(x) + '월' for x in range(1,13)]

['1월', '2월', '3월', '4월', '5월', '6월', '7월', '8월', '9월', '10월', '11월', '12월']

* index name

In [16]:
df1.index.name = '분기별'
df1

     Apple  Samsung
분기별
1분기      1        2
2분기      2        3
3분기      3        4

* 컬럼면 변경

In [17]:
df1.columns = ['Apple', 'Benz']
df1

     Apple  Benz
분기별
1분기      1     2
2분기      2     3
3분기      3     4

In [19]:
df1.columns = ['oreo', 'hihi']
df1

     oreo  hihi
분기별
1분기     1     2
2분기     2     3
3분기     3     4

* 여러개의 컬럼명 변경  
    (데이터프레임에 없는 컬럼명 써도 에러 안남)
* 분석 시 여러개의 컬럼명을 미리 적어놓고 필요할때 사용하는것도 팁
* 전사에서 컬럼명 사전이 있으면 그에 따라서 사용

In [22]:
df1.rename(columns={'oreo':'kia', "hihi":"hmm", "emart":"lottemart","sex":"성별"})

     kia  hmm
분기별
1분기    1    2
2분기    2    3
3분기    3    4

In [24]:
df3 = df1.rename(columns = {'oreo':'tesla', "hihi":'amd'})
df3

     tesla  amd
분기별
1분기      1    2
2분기      2    3
3분기      3    4

In [25]:
kbo = pd.read_csv('./kbo.csv')

* 컬럼 확인

In [27]:
kbo.columns

Index(['선수명', '등번호', '생년월일', '포지션', '신장/체중', '경력', '입단 계약금', '연봉', '지명순위',
       '입단년도'],
      dtype='object')

* 필요한 컬럼 선택해서 DataFrame으로 만들기
* [[]] -> 데이터프레임

In [28]:
kbo[['등번호', '생년월일', '포지션']]

      등번호           생년월일        포지션
0    21.0  1992년 12월 18일   투수(우투우타)
1    49.0  1993년 10월 19일  내야수(우투우타)
2    78.0  2001년 07월 26일   투수(우투좌타)
3    59.0  1997년 02월 17일   투수(좌투좌타)
4    65.0  1997년 04월 05일  외야수(우투우타)
..    ...            ...        ...
852  16.0  1994년 02월 25일  내야수(우투좌타)
853  59.0  2001년 03월 17일   투수(우투우타)
854  26.0  1999년 02월 12일   포수(우투우타)
855  60.0  1995년 12월 26일   투수(좌투좌타)
856   NaN  1992년 01월 10일  내야수(우투우타)

[857 rows x 3 columns]

In [29]:
kbo[['등번호']]

      등번호
0    21.0
1    49.0
2    78.0
3    59.0
4    65.0
..    ...
852  16.0
853  59.0
854  26.0
855  60.0
856   NaN

[857 rows x 1 columns]

In [30]:
kbo.등번호

0      21.0
1      49.0
2      78.0
3      59.0
4      65.0
       ...
852    16.0
853    59.0
854    26.0
855    60.0
856     NaN
Name: 등번호, Length: 857, dtype: float64

In [31]:
kbo.columns

Index(['선수명', '등번호', '생년월일', '포지션', '신장/체중', '경력', '입단 계약금', '연봉', '지명순위',
       '입단년도'],
      dtype='object')

In [32]:
kbo = kbo[['선수명',  '생년월일', '포지션','등번호', '신장/체중', '경력', '입단 계약금', '연봉', '지명순위',
       '입단년도']].head(1)

In [33]:
kbo.head(1)

,선수명,생년월일,포지션,등번호,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도
0,강동연,1992년 12월 18일,투수(우투우타),21.0,195cm/94kg,진북초-덕수중-유신고-두산-상무-두산,NaN,4400만원,11 두산 육성선수,12두산

## 행 삭제

* 디폴트는 행 삭제. 열삭제를 위해서는 axis=1 추가
* inplace = True 를 추가하지 않으면 삭제한 내용이 반영 안됨

In [36]:
df1.drop(['2분기'], inplace = True)
df1

     oreo  hihi
분기별
3분기     3     4

In [37]:
df1.drop(['oreo'], axis=1)

     hihi
분기별
3분기     4

In [38]:
df3 = df2
df2

   A  B
0  1  2
1  2  3
2  3  4

In [39]:
df3

   A  B
0  1  2
1  2  3
2  3  4

In [40]:
df3.iloc[0,0]

1

In [41]:
df3.iloc[0,0] = 100
df3

     A  B
0  100  2
1    2  3
2    3  4

In [42]:
df4 = df2.copy()
df4

     A  B
0  100  2
1    2  3
2    3  4

In [43]:
df4.iloc[0,0] = 1000

In [45]:
df2

     A  B
0  100  2
1    2  3
2    3  4

* 데이터프레임에서 원하는 값 필터링

In [46]:
투수 = kbo[kbo['포지션'] == '투수(우투우타)'].copy()

In [47]:
투수['키'] = 투수['신장/체중'].apply(lambda x: x.split("/")[0])

In [48]:
kbo

,선수명,생년월일,포지션,등번호,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도
0,강동연,1992년 12월 18일,투수(우투우타),21.0,195cm/94kg,진북초-덕수중-유신고-두산-상무-두산,NaN,4400만원,11 두산 육성선수,12두산

* 데이터프레임 행 추가

In [49]:
df4

      A  B
0  1000  2
1     2  3
2     3  4

In [50]:
df4.loc[3, ['A','B']] = [5,6]
df4

        A    B
0  1000.0  2.0
1     2.0  3.0
2     3.0  4.0
3     5.0  6.0

In [51]:
df4.loc[4, ['A','B']] = [5,6]

In [52]:
df4.loc[4, ['A','B']] = [7,8]

In [53]:
df4

        A    B
0  1000.0  2.0
1     2.0  3.0
2     3.0  4.0
3     5.0  6.0
4     7.0  8.0

* 인덱스 초기화

In [55]:
df4.reset_index(drop=True, inplace=True)

In [56]:
df4

        A    B
0  1000.0  2.0
1     2.0  3.0
2     3.0  4.0
3     5.0  6.0
4     7.0  8.0

### 인덱스 설정(컬럼 -> 인덱스)

In [59]:
kbo.set_index("선수명", inplace=True)

In [60]:
kbo

,생년월일,포지션,등번호,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도
선수명,,,,,,,,,
강동연,1992년 12월 18일,투수(우투우타),21.0,195cm/94kg,진북초-덕수중-유신고-두산-상무-두산,NaN,4400만원,11 두산 육성선수,12두산